meeting/agenda/2022/12-20.org
:PROPERTIES:
:ID:       2CAB0D45-F86A-426E-9439-D299F15D16F2
:END:
#+title: QT4 CG Meeting 016 Agenda 2022-12-20
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

Regrets for the next meeting?

Reminder, the CG Will not meet on 27 December or 3 January.

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2022/12-13.html][the previous meeting]].

** Review of  open action items [2/4]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-014-01: MK to propose new ~try-get~ functions for arrays, maps, and (maybe) sequences
+ [ ] QT4CG-015-01: MK to change the name of the argument to =array:index-where= from =$input= to =$array=
+ [ ] QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views
+ [ ] QT4CG-015-03: NW to make sure the direction of the arrow is in the legend
+ [ ] QT4CG-015-04: NW to investigate of a dynamic presentation is practical
+ [ ] QT4CG-015-05: MK to raise a PR to resolve issue #107, self::(a|b|c)

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:


** Issue #281
:PROPERTIES:
:CUSTOM_ID: h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C
:END:

We had [[https://qt4cg.org/meeting/minutes/2022/12-13.html#issue-281][some discussion]] of [[https://github.com/qt4cg/qtspecs/issues/281][#281]] last week, but no resolution.

** Issue #170, XPath “otherwise” operator
:PROPERTIES:
:CUSTOM_ID: issue-170
:END:

MK [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0017.html][proposes]] that [[https://github.com/qt4cg/qtspecs/issues/170][this issue]] may be ready to be decided.

At the meeting [[https://qt4cg.org/meeting/minutes/2022/12-13.html#issue-170][last week]], no one present could recall why this issue
had been postponed.

** Review pull request #259: parse-html (issue #74)
:PROPERTIES:
:CUSTOM_ID: pr-parse-html
:END:

See [[https://qt4cg.org/dashboard/#pr-259][pull request #259]]

** Review pull request #261: fn:char (issue #121)
:PROPERTIES:
:CUSTOM_ID: pr-fn-char
:END:

See [[https://qt4cg.org/dashboard/#pr-261][pull request #261]]

** Review pull request #284: Grammar for if-then w/o else
:PROPERTIES:
:CUSTOM_ID: pr-grammar-if-then-else
:END:

See [[https://qt4cg.org/dashboard/#pr-284][pull request #284]]

** XPath 4.0 functions
:PROPERTIES:
:CUSTOM_ID: xpath-40-functions
:END:

*** fn:duplicate-values
:PROPERTIES:
:CUSTOM_ID: fn-duplicate-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/123][#123]]
+ See also [[../../minutes/2022/10-04.html#h-782DCD58-658F-44BC-8AD7-1EE8301228F1][discussion from last meeting]]

*** fn:replace (action) 
:PROPERTIES:
:CUSTOM_ID: fn-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace

*** fn:format-number (minor fixes)
:PROPERTIES:
:CUSTOM_ID: fn-format-number
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number

*** fn:json
:PROPERTIES:
:CUSTOM_ID: fn-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json

*** fn:differences
:PROPERTIES:
:CUSTOM_ID: fn-differences
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences

Editorially, this function is not ready for approval. We should decide
if we want to pursue it, and if we do, how.

*** fn:stack-trace
:PROPERTIES:
:CUSTOM_ID: fn-stack-trace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace

*** +map:group-by+
:PROPERTIES:
:CUSTOM_ID: map-group-by
:END:
+ +See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by+

Superceded by [[https://github.com/qt4cg/qtspecs/pull/203][map:build]], per [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html][MK]].

*** map:replace
:PROPERTIES:
:CUSTOM_ID: map-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace

*** map:substitute
:PROPERTIES:
:CUSTOM_ID: map-substitute
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute

*** map:entries
:PROPERTIES:
:CUSTOM_ID: map-entries
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]] and [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:replace
:PROPERTIES:
:CUSTOM_ID: array-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace

*** array:slice
:PROPERTIES:
:CUSTOM_ID: array-slice
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice

*** array:partition
:PROPERTIES:
:CUSTOM_ID: array-partition
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition

*** fn:parts
:PROPERTIES:
:CUSTOM_ID: fn-parts
:END:
+ See ???

*** fn:convert-to/from-EQName
:PROPERTIES:
:CUSTOM_ID: fn-convert-to-from-EQName
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/1][#1]]

*** fn:parse-html
:PROPERTIES:
:CUSTOM_ID: fn-parse-html
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/74][#74]]

*** fn:split-by-graphemes
:PROPERTIES:
:CUSTOM_ID: fn-split-by-graphemes
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/73][#73]]

*** fn:until
:PROPERTIES:
:CUSTOM_ID: fn-until
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/80][#80]]

*** fn:nl, fn:cr, fn:tab
:PROPERTIES:
:CUSTOM_ID: fn-nl-etc
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/121][#121]]

*** fn:deep-normalize-space
:PROPERTIES:
:CUSTOM_ID: fn-deep-normalize-space
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/79][#79]]

*** fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels
:PROPERTIES:
:CUSTOM_ID: fn-parcel-etc
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:values, map:values
:PROPERTIES:
:CUSTOM_ID: array-values-map-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]]

*** fn:distinct-values (semantics)
:PROPERTIES:
:CUSTOM_ID: fn-distinct-values
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values

*** fn:deep-equal (options)
:PROPERTIES:
:CUSTOM_ID: fn-deep-equal
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal

*** fn:parse-json (number formatting)
:PROPERTIES:
:CUSTOM_ID: fn-parse-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

Happy holidays, everyone!
